question
rape
bride
kidnap
videowhen
state
i
fact
society
culture
bit
progressive
united
state
irrelevant
least
one
instance
rape
occur
even
today
society
location
progressive
region
united
state
i
law
protect
man
tradition
different
i
fact
rape
take
place
united
state
irrelevant
act
man
commit
ground
determine
rape
take
place
matter
region
i
believe
miss
main
point
previous
argument
i
fact
rape
occur
united
state
i
world
make
cultural
importance
i
i
mean
i
yes
i
philosophy
kyrgyzstan
irrelevant
i
argue
cultural
connotation
philosophy
directly
relevant
marriage
kidnap
tradition
i
importance
local
culture
tradition
basis
judgment
kidnapper
i
also
victim
i
would
absolutely
ignorant
culturally
elitist
interpreted
action
describe
video
viewpoint
outside
observer
i
interpretation
event
make
strictly
use
one
i
personal
culture
comparison
basis
i
person
united
state
might
view
tradition
i
bride
kidnap
i
unquestionable
crime
rape
i
culturally
relevant
observer
might
see
event
simply
everyday
typical
occurrence
i
socially
valuable
kyrgyzstan
culture
i
claim
i
law
protect
man
tradition
different
i
applies
tradition
jurisdiction
law
i
indeed
i
u
law
would
protect
bride
kidnapper
commit
act
u
territory
i
i
use
term
i
law
i
something
exact
universal
meaning
world
i
obviously
i
constitutes
punishment
theft
u
might
even
remotely
similar
type
punishment
act
part
world
i
state
i
i
make
clear
constitutes
rape
different
one
country
another
i
law
must
recognize
rape
constitute
whole
i
feel
elect
rely
law
standard
relevant
kyrgyzstan
impose
law
social
ideology
discuss
ostrich
i
mainly
focus
u
law
i
neither
groom
bride
video
living
set
law
i
bride
point
video
indicate
action
take
groom
violation
person
eventually
accept
event
unfolded
natural
occurrence
i
part
nation
i
tradition
i
initially
upset
way
take
initial
struggle
quickly
replace
realization
participate
tradition
i
point
willingly
accept
notion
get
marry
i
27mins09
sec
i
i
conclusion
i
believe
unreasonable
judge
young
men
video
person
commit
act
rape
i
use
force
illustrate
video
demonstrative
lack
consent
kidnap
woman
longer
relevant
moment
bride
willingly
agree
become
wife
i
even
initial
harm
do
process
kidnap
eventually
interpret
way
follow
local
tradition
i
require
crime
rape
guilty
intent
present
point
act
i
moment
kidnap
wed
ceremony
i
everyone
involve
i
include
bride
i
believe
follow
tradition
absolve
anything
could
judge
intentional
wrongdoing
i
argument
could
make
i
abandonment
tradition
moral
basis
i
action
take
groom
video
evidence
rape
nontraditional
rape
occur
i
